
## Plan Result (prod)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.storage-account.azurerm_storage_container.container[&#34;uploadedfiles&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.storage-account.azurerm_storage_container.container["uploadedfiles"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type             = "private"
      + default_encryption_scope          = (known after apply)
      + encryption_scope_override_enabled = true
      + has_immutability_policy           = (known after apply)
      + has_legal_hold                    = (known after apply)
      + id                                = (known after apply)
      + metadata                          = (known after apply)
      + name                              = "uploadedfiles"
      + resource_manager_id               = (known after apply)
      + storage_account_name              = "taxtribunalssaprod"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":40,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->